system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1.0;

vertices
(
    (0      0       0)
    (0      0.02    0)
    (0      0.025   0)
    (0.5    0.025   0)
    (0.5    0.02    0)
    (0.51   0.02    0)
    (0.51    0.025   0)
    (1.0    0.025   0)
    (1.0    0.02    0)
    (1.0    0       0)
    (0.51   0       0)
    (0.5    0       0)
    (0      0       0.001)
    (0      0.02    0.001)
    (0      0.025   0.001)
    (0.5    0.025   0.001)
    (0.5    0.02    0.001)
    (0.51   0.02    0.001)
    (0.51   0.025   0.001)
    (1.0    0.025   0.001)
    (1.0    0.02    0.001)
    (1.0    0       0.001)
    (0.51    0       0.001)
    (0.5    0       0.001)
);

blocks
(
    hex (0 11 4 1  12 23 16 13) (100 20 1) simpleGrading (1 1 1)
    hex ( 1 4 3 2  13 16 15 14) (100 10 1) simpleGrading (1 1 1)
    hex (11 10 5 4   23 22 17 16) (20 20 1) simpleGrading (1 1 1)
    hex (10 9 8 5   22 21 20 17) (100 20 1) simpleGrading (1 1 1)
    hex (5 8 7 6   17 20 19 18) (100 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 13 12)
            (1 2 14 13)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (9 8 20 21)
            (8 7 19 20)

        );
    }
    symm
    {
        type patch;
        faces
        (
            (0 11 23 12)
            (11 10 22 23)
            (10 9 21 22)

        );
    }
    walls
    {
        type wall;
        faces
        (
            (2 3 15 14)
            (3 4 16 15)
            (4 5 17 16)
            (5 6 18 17)
            (6 7 19 18)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 11 4 1)
            (1 4 3 2)
            (11 10 5 4)
            (10 9 8 5)
            (5 8 7 6)
            (12 23 16 13)
            (13 16 15 14)
            (23 22 17 16)
            (22 21 20 17)
            (17 20 19 18)


        );
    }
);
// ************************************************************************* //
