system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         leastSquares;
    
}

divSchemes
{
   div(phi,U) Gauss linearUpwind grad(U);
   div(phi,omega) Gauss linearUpwind default;
   div(phi,k) Gauss linearUpwind default;
   div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default            Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}
relaxationFactors
{
   p 0.3;
   U 0.7;
} 

// ************************************************************************* //
