system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
       solver                      GAMG;
       tolerance                   1e-5;
       relTol                      0.01;
       smoother                    GaussSeidel;
       nPreSweeps                  0;
       nPostSweeps                 2;
       cacheAgglomeration          on;
       agglomerator                faceAreaPair;
       nCellsInCoarsestLevel       1000;
       mergeLevels                 1;
    }


    U
    {
        solver                    PBiCG;
        preconditioner            DILU;
        tolerance                 1e-8;
        relTol                    0.0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;

    residualControl
    {
        p               1e-2;
        U               1e-3;
    }
}
relaxationFactors 
{ 
    equations 
    { 
        U               0.9; 
        p               0.9;
    } 
// ************************************************************************* //
